package com.javaex.practice;

public class Ex06 {
	/*
	 * 
	아래의 설명중 틀린 것을 찾아서 수정해 보세요.
	(1)	변수한개에는 동시에 여러 개의 값을 담을 수 있다.
		==> 변수는 하나의 값을 저장할 수 있는 메모리 공간이다. 
		--> 변수 한 개에는 한 번에 한 개만 같은 자료형의 값을 담을 수 있다.
		
	(2)	변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		--> 변수 선언 시에 사용한 타입의 값만 저장할 수 있다. 
		
	(3)	변수는 초기값이 저장되지 않아도 읽을 수 있다.
		==> 변수는 저장되지 않으면 읽을 수 없다.
		--> 초기값이 저장되지 않으면 사용할 수 없다.
		
	(4)	모든 자료형의 변수는 동일한 방식으로 저장된다. 
		==> 자료형 변수는 기본자료형과 참조자료형으로 나눌 수 있다.
		--> 자료형에 따라 변수의 저장방식은 달라진다.  
		
	(5)	double형은 flaot보다 큰 수를 담을 수 있다.
		--> double형은 8byte, float형은 4byte로 실수형의 경우 큰 byte의 자료형이 정확한 값을 사용할 수 있다.
	
	(6)	int, float, char, String은 모두 기본자료형에 속한다
		==> int, float, char는 기본자료형, String은 참조자료형에 속한다.
		
	(7)	final로 선언된 변수는 수정이 가능하다
		==> final로 선언된 변수는 선언시에만 저장할 수 있고 수정은 불가능하다.
		--> final로 선언된 변수를 상수라 부르며 한 번 초기화된 값은 변경할 수 없다.
			보통 상수로 선언된 상수명은 대문자로 표기하여 구분한다. 
		
	(8)	long형은 항상 L을 붙여서 대입해야한다.	
		--> long형은 int범위를 넘는 값에 대해서만 L기호를 붙여 사용한다. 
		
	(9)	float형은 항상 F을 붙여서 대입해야한다.

		
	
	*/

}
